app/views/store/index.html.erb

<% cache ['store', Product.latest] do%>
---
SELECT "products".* FROM "products" ORDER BY "products"."updated_at" DESC LIMIT 1